<template>
	<view class="page-padding" style="font-size: 18rpx;">
		1、总则<br>
		1.1、 绿有购是黎平县八佰里花果山油茶农民专业合作社旗下产品，绿有购是一款电商平台,<br>
		1.2、用户在注册之前，应当仔细阅读本协议。用户在进行注册程序过程中，点击同意按钮，即表示用户完全接受本协议的全部条款。用户注册时实行实名认，并按照页面上的提示完成全部的注册程序，一旦注册成功，即为本软件的会员，则与绿有购之间自动形成协议关系，用户应当受本协议的约束。绿有购以下简称软件，服务使用人以下称用户。
		<br>
		1.3、本协议由绿有购随时更新，用户应当及时关注并同意本站不承担通知义务。本站的通知、公告、声明或其它类似内容是本协议的一部分。<br>
		1.4、绿有购尽最大的能力满足用户的需求，以质量第一、信守承诺为宗旨。尽力保证网络服务及时、安全、准确、保密、有效。绿有购除自身以外的原因以及战争、地震、自然灾害不可抗力的原因除外。以下称这些情况为特殊情况。<br>
		2、服务内容<br>
	2.1、 绿有购是根据中华民族的民族特点，研究开发的一款网购分红的软件。遇有特殊情况绿有购保留变更、中断、终止部分或全部网络服务的权利，<br>
		2.2、绿有购在提供网络服务时，不会收取用户的任何费用。<br>
		2.3、绿有购仅提供相关的网络服务，除此之外与相关网络服务有关的设备(如电脑、调制解调器及其他与接入互联网有关的装置)及所需的费用(如为接入互联网而支付的电话费及上网费)均应由用户自行负担，<br>
		3、使用规则<br>
		3.1、用户在申请使用绿有购的网络服务时，必须向软件提供真实、准确的个人资料，进行注册。如个人资料有变动，及时更新。<br>
	   3.2、用户注册成功后，软件将给予每个用户一个独立的帐号和相应的密码，该用户帐号和密码由用户负责保管:用户应当对帐号进行的所有活动和事件负法律责任。
	     用户必须同意接受软件通过电子邮件、微信短信或其他方式向用户发送的家谱成员注册信息、通知信息和其他相关商业信息。<br>
		3.4、用户在使用绿有购的网络服务过程中，必须遵循以下原则:<br>
		(1)遵守中华人民共和国的有关的法律和法规:<br>
		(2)不得为任何非法目的而使用网络服务系统:<br>
		(3)遵守所有与网络服务有关的网络协议、规定和程序:<br>
		(4)不得利用绿有购的网络服务系统进行任何可能对互联网的正常运转造成不利影响的行为<br>
		(5)不得利用绿有购的网络服务系统传输任何骚扰、诱导、欺骗、辱骂、恐吓、唐俗、淫秽的或其他任何非法的信息资料;<br>
		(6)不得利用绿有购的网络服务系统进行任何不利于国家、社会、人民及公民个人的行为<br>
		(7)用户如发现有任何非法使用帐号或帐号出现安全漏洞的情况，应立即通报绿有购。<br>
		4、内容所有权<br>
		4.1、绿有购提供的网络服务内容包括:文字、软件、声音、图片、录像、图表等。所有这些内容都受版权、商标权、著作权和其它财产所有权的法律保护。<br>
		
		4.2、用户只有在获得本软件的会员或其他相关权利人的授权之后才能使用这些内容，而不能擅自复制、仿制、再造，或者创造与内容有关的派生产品，<br>
		5、隐私保护<br>
		5.1、为了保护用户隐私权，绿有购绝对对用户的个人信息实行保密。软件保证不对外公开或向第三方提供用户的注册资料，及用户在使用网络服务时存储在云端的非公开内容。但下列情况除外:<br>
		
		(1)事先获得用户的明确授权:<br>
		(2)根据有关的法律法规要求:<br>
		(3)按照相关政府主管部门的要求:<br>
		(4)为维护社会公众的利益:<br>
	    (5)为维护用户及会员的合法权益。<br>
		5.2、在不透露单个用户隐私资料的前提下，软件有权对整个用户数据库进行分析并对用户数据库进行商业上的利用，<br>
		6、免责声明<br>
		6.1、若软件已经明示其网络服务提供方式发生变更并提醒用户应当注意事项，用户未按要求操作所产生的一切后果由用户自行承担<br>
        6.2、用户明确其使用网络服务所存在的风险，其责任完全由自己承担:因使用网络服务而产生的一切后果也由自己承担，软件对用户不承担任何责任。<br>
		7、服务变更、中断或终止<br>
		7.1、如因系统维护或升级，需要暂停网络服务，软件将尽可能事先进行通告。<br>
	    7.2、如发生下列任何一种情形，绿有购有权随时中断或终止向用户提供本协议项下的网络服务而无需通知用户;<br>
		(1)用户提供的个人资料不真实:<br>
		(2)用户违反本协议中规定的使用规则;<br>
		(3)软件遇有黑客、病毒、严重的侵权行为:<br>
		(4)不属于本软件自身的其他原因<br>
		(5)地震、战争、严重自然灾害及不可抗力和其他不可预见的特殊情况。<br>
		8、违约责任<br>
		8.1、用户同意保障和维护软件及其他用户的利益，如因用户违反有关法律、法规或本协议的任何条款，而给绿有购或任何<br>
		其他第三人造成损失，用户同意承担由此造成损害的赔偿责任，<br>
		9、协议修改<br>
		9.1、软件将可能修改本协议的有关条款，一旦条款内容发生变动，将会在相关的页面提示修改内容。<br>
		9.2、用户不同意对服务条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受服务条款的变动。<br>10、用户管理
		用户单独承担发布内容的法律责任。用户对所发布的内容，是符<br>
		合所有法律、法规、规章、制度的规定，并且承诺，<br>
		(1)在绿有购的网页上发布信息或者利用网易的服务时必须遵守中华人民共和国有关法规(部分法规请见附录)，不得在绿有购的网页上或者利用网易的服务制作、复制、发布、传播以下信息:<br>
		(a)反对宪法所确定的基本原则的:<br>
		(b)危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的;<br>
		(c)损害国家荣誉和利益的:<br>
		(d)煽动民族仇恨、民族歧视，破坏民族团结的:<br>
		(e)破坏国家宗教政策，宣扬邪教和封建迷信的:(f)散布谣言，扰乱社会秩序，破坏社会稳定的:<br>
		(q)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的;<br>
		(h)侮辱或者诽谤他人，侵害他人合法权益的:<br>
		(i)含有法律、行政法规禁止的其他内容的。<br>
		(2)在绿有购的网页上发布信息或者利用网易的服务时还<br>
		必须符合其他有关国家和地区的法律规定以及国际法的有关规<br>
		定。<br>
		(3)不利用绿有购的服务从事以下活动:<br>
		(a)未经允许，进入计算机信息网络或者使用计算机信息<br>
		网络资源;<br>
		(b)未经允许，对计算机信息网络功能进行删除、修改或者增加的;<br>
		(c)未经允许，对进入计算机信息网络中存储、处理或者<br>
		传输的数据和应用程序进行删除、修改或者增加的;<br>
		(d)故意制作、传播计算机病毒等破坏性程序的:<br>
		(e)其他危害计算机信息网络安全的行为。<br>
		(4)不以任何方式干扰绿有购的服务。<br>
		(5)遵守法律、法规、规章的所有其他规定和程序。<br>
		用户需对自己在使用绿有购服务过程中的行为承担法律责任。如果绿有购发现其软件传输的信息明显属于用户管理第<br>
	    (1)条所列内容之一，依据中华人民共和国法律，绿有购有义
	    务立即停止传输，保存有关记录，向国家有关机关报告，并目册
	    除含有该内容的地址、目录或关闭服务器。 用户使用绿有购站
	    平台发布信息，包括广告牌、寻根问祖、家族论坛、家族信仰
	    网络聊天室和留言板等，以交互形式为上网用户提供信息发布信
	    息的行为，也须遵守本规定。 若用户的行为违反本协议的相关条款，绿有购将取消对该用户的服务权利<br>
		 <h2 style="margin-top: 10px;">本协议自签订之日起生效。 本协议签订之日，即用户注册时，点击'同意’的当天,视为合同已签订生效。</h2> <br>
		<span style="float: right;">黎平县八佰里花果山油茶农民专业合作社</span> <br>
		<span style="width: 100%; text-align: center;display: inline-block;margin-top: 10px;">
			绿有购<br>
			Copyright © 2022
		</span>
	
	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			}
		},
		methods: {
			
		}
	}
</script>

<style>

</style>
